experiments/results/20201017T121311/node92/tmp/SmartTrie/logs/benchmark.log
Command line: -t -s -db smarttrie.app.client.Client -P config/workload
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2020-10-17 17:07:20:624 0 sec: 0 operations; est completion in 0 second 
2020-10-17 17:07:21:556 1 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2020-10-17 17:07:21.591 [Thread-2] INFO  b.c.c.n.NettyClientServerCommunicationSystemClientSide - Connecting to replica 0 at /192.168.3.91:11000
2020-10-17 17:07:21.613 [nioEventLoopGroup-2-1] INFO  b.c.c.n.NettyClientServerCommunicationSystemClientSide - Channel active
2020-10-17 17:07:22:556 2 sec: 509 operations; 509 current ops/sec; est completion in 32 minutes [UPDATE: Count=511, Max=1251327, Min=799, Avg=3808.43, 90=2407, 99=3845, 99.9=5847, 99.99=1251327] 
2020-10-17 17:07:23:555 3 sec: 1893 operations; 1384 current ops/sec; est completion in 13 minutes [UPDATE: Count=1383, Max=26751, Min=551, Avg=700.76, 90=799, 99=1038, 99.9=2871, 99.99=26751] 
2020-10-17 17:07:24:556 4 sec: 3556 operations; 1663 current ops/sec; est completion in 9 minutes [UPDATE: Count=1664, Max=1918, Min=541, Avg=587.85, 90=624, 99=708, 99.9=880, 99.99=1918] 
2020-10-17 17:07:25:556 5 sec: 4948 operations; 1392 current ops/sec; est completion in 8 minutes [UPDATE: Count=1391, Max=39967, Min=509, Avg=703.24, 90=892, 99=1069, 99.9=2179, 99.99=39967] 
2020-10-17 17:07:26:555 6 sec: 6580 operations; 1632 current ops/sec; est completion in 7 minutes [UPDATE: Count=1632, Max=1438, Min=497, Avg=599.54, 90=774, 99=991, 99.9=1127, 99.99=1438] 
2020-10-17 17:07:27:556 7 sec: 8326 operations; 1746 current ops/sec; est completion in 6 minutes [UPDATE: Count=1747, Max=27487, Min=474, Avg=564.15, 90=570, 99=726, 99.9=1774, 99.99=27487] 
2020-10-17 17:07:28:556 8 sec: 9982 operations; 1656 current ops/sec; est completion in 6 minutes [UPDATE: Count=1656, Max=45439, Min=428, Avg=596.67, 90=533, 99=632, 99.9=39071, 99.99=45439] 
2020-10-17 17:07:29:555 9 sec: 11974 operations; 1992 current ops/sec; est completion in 6 minutes [UPDATE: Count=1992, Max=7679, Min=428, Avg=496.44, 90=537, 99=589, 99.9=917, 99.99=7679] 
2020-10-17 17:07:30:555 10 sec: 14072 operations; 2098 current ops/sec; est completion in 5 minutes [UPDATE: Count=2097, Max=773, Min=444, Avg=473.34, 90=510, 99=561, 99.9=634, 99.99=773] 
2020-10-17 17:07:31:556 11 sec: 16105 operations; 2033 current ops/sec; est completion in 5 minutes [UPDATE: Count=2033, Max=38911, Min=423, Avg=487.46, 90=510, 99=556, 99.9=747, 99.99=38911] 
2020-10-17 17:07:32:555 12 sec: 18247 operations; 2142 current ops/sec; est completion in 5 minutes [UPDATE: Count=2142, Max=3971, Min=419, Avg=462.84, 90=504, 99=556, 99.9=659, 99.99=3971] 
2020-10-17 17:07:33:555 13 sec: 20398 operations; 2151 current ops/sec; est completion in 5 minutes [UPDATE: Count=2151, Max=3349, Min=419, Avg=461.13, 90=505, 99=549, 99.9=640, 99.99=3349] 
2020-10-17 17:07:34:555 14 sec: 22638 operations; 2240 current ops/sec; est completion in 4 minutes [UPDATE: Count=2241, Max=2239, Min=418, Avg=442.79, 90=475, 99=540, 99.9=696, 99.99=2239] 
2020-10-17 17:07:35:555 15 sec: 24695 operations; 2057 current ops/sec; est completion in 4 minutes [UPDATE: Count=2056, Max=1968, Min=420, Avg=482.46, 90=540, 99=616, 99.9=742, 99.99=1968] 
2020-10-17 17:07:36:555 16 sec: 26602 operations; 1907 current ops/sec; est completion in 4 minutes [UPDATE: Count=1912, Max=41855, Min=421, Avg=518.8, 90=546, 99=630, 99.9=894, 99.99=41855] 
2020-10-17 17:07:37:555 17 sec: 28745 operations; 2143 current ops/sec; est completion in 4 minutes [UPDATE: Count=2139, Max=11127, Min=419, Avg=462.63, 90=499, 99=571, 99.9=1550, 99.99=11127] 
2020-10-17 17:07:38:555 18 sec: 30887 operations; 2142 current ops/sec; est completion in 4 minutes [UPDATE: Count=2146, Max=644, Min=426, Avg=463.48, 90=503, 99=547, 99.9=574, 99.99=644] 
2020-10-17 17:07:39:555 19 sec: 33032 operations; 2145 current ops/sec; est completion in 4 minutes [UPDATE: Count=2141, Max=744, Min=422, Avg=462.77, 90=503, 99=548, 99.9=594, 99.99=744] 
2020-10-17 17:07:40:555 20 sec: 35169 operations; 2137 current ops/sec; est completion in 4 minutes [UPDATE: Count=2136, Max=12911, Min=417, Avg=464.3, 90=499, 99=563, 99.9=669, 99.99=12911] 
2020-10-17 17:07:41:555 21 sec: 37354 operations; 2185 current ops/sec; est completion in 4 minutes [UPDATE: Count=2185, Max=653, Min=418, Avg=454.2, 90=496, 99=541, 99.9=616, 99.99=653] 
2020-10-17 17:07:42:555 22 sec: 39486 operations; 2132 current ops/sec; est completion in 4 minutes [UPDATE: Count=2133, Max=595, Min=441, Avg=465.45, 90=497, 99=549, 99.9=580, 99.99=595] 
2020-10-17 17:07:43:555 23 sec: 41655 operations; 2169 current ops/sec; est completion in 4 minutes [UPDATE: Count=2169, Max=17551, Min=415, Avg=457.37, 90=490, 99=540, 99.9=694, 99.99=17551] 
2020-10-17 17:07:44:555 24 sec: 43697 operations; 2042 current ops/sec; est completion in 4 minutes [UPDATE: Count=2042, Max=47999, Min=415, Avg=485.44, 90=499, 99=550, 99.9=1121, 99.99=47999] 
2020-10-17 17:07:45:555 25 sec: 45858 operations; 2161 current ops/sec; est completion in 4 minutes [UPDATE: Count=2161, Max=13103, Min=414, Avg=459.12, 90=494, 99=541, 99.9=632, 99.99=13103] 
2020-10-17 17:07:46:555 26 sec: 47927 operations; 2069 current ops/sec; est completion in 4 minutes [UPDATE: Count=2069, Max=5951, Min=422, Avg=479.19, 90=526, 99=588, 99.9=644, 99.99=5951] 
2020-10-17 17:07:47:555 27 sec: 50010 operations; 2083 current ops/sec; est completion in 4 minutes [UPDATE: Count=2083, Max=591, Min=443, Avg=476.39, 90=512, 99=550, 99.9=583, 99.99=591] 
2020-10-17 17:07:48:555 28 sec: 52082 operations; 2072 current ops/sec; est completion in 4 minutes [UPDATE: Count=2072, Max=842, Min=439, Avg=478.94, 90=524, 99=578, 99.9=623, 99.99=842] 
2020-10-17 17:07:49:555 29 sec: 54132 operations; 2050 current ops/sec; est completion in 3 minutes [UPDATE: Count=2049, Max=13127, Min=438, Avg=483.82, 90=516, 99=552, 99.9=646, 99.99=13127] 
2020-10-17 17:07:50:555 30 sec: 56122 operations; 1990 current ops/sec; est completion in 3 minutes [UPDATE: Count=1990, Max=13439, Min=448, Avg=498.07, 90=526, 99=571, 99.9=609, 99.99=13439] 
2020-10-17 17:07:51:555 31 sec: 58132 operations; 2010 current ops/sec; est completion in 3 minutes [UPDATE: Count=2010, Max=605, Min=438, Avg=493.39, 90=532, 99=571, 99.9=588, 99.99=605] 
2020-10-17 17:07:52:555 32 sec: 59961 operations; 1829 current ops/sec; est completion in 3 minutes [UPDATE: Count=1830, Max=50879, Min=435, Avg=541.25, 90=551, 99=611, 99.9=1024, 99.99=50879] 
2020-10-17 17:07:53:555 33 sec: 61956 operations; 1995 current ops/sec; est completion in 3 minutes [UPDATE: Count=1995, Max=13103, Min=432, Avg=497.05, 90=532, 99=610, 99.9=724, 99.99=13103] 
2020-10-17 17:07:54:555 34 sec: 64063 operations; 2107 current ops/sec; est completion in 3 minutes [UPDATE: Count=2106, Max=831, Min=417, Avg=471.47, 90=518, 99=562, 99.9=618, 99.99=831] 
2020-10-17 17:07:55:555 35 sec: 66209 operations; 2146 current ops/sec; est completion in 3 minutes [UPDATE: Count=2146, Max=5271, Min=418, Avg=463.07, 90=503, 99=548, 99.9=651, 99.99=5271] 
2020-10-17 17:07:56:556 36 sec: 68354 operations; 2145 current ops/sec; est completion in 3 minutes [UPDATE: Count=2145, Max=2159, Min=416, Avg=463.1, 90=503, 99=571, 99.9=675, 99.99=2159] 
2020-10-17 17:07:57:555 37 sec: 70248 operations; 1894 current ops/sec; est completion in 3 minutes [UPDATE: Count=1894, Max=112575, Min=416, Avg=524.46, 90=508, 99=552, 99.9=617, 99.99=112575] 
2020-10-17 17:07:58:555 38 sec: 72314 operations; 2066 current ops/sec; est completion in 3 minutes [UPDATE: Count=2066, Max=9919, Min=418, Avg=480.81, 90=524, 99=712, 99.9=797, 99.99=9919] 
2020-10-17 17:07:59:555 39 sec: 74276 operations; 1962 current ops/sec; est completion in 3 minutes [UPDATE: Count=1962, Max=9823, Min=419, Avg=505.95, 90=540, 99=746, 99.9=877, 99.99=9823] 
2020-10-17 17:08:00:555 40 sec: 76216 operations; 1940 current ops/sec; est completion in 3 minutes [UPDATE: Count=1940, Max=6995, Min=444, Avg=511.53, 90=546, 99=585, 99.9=643, 99.99=6995] 
2020-10-17 17:08:01:555 41 sec: 77969 operations; 1753 current ops/sec; est completion in 3 minutes [UPDATE: Count=1753, Max=59455, Min=475, Avg=565.99, 90=572, 99=624, 99.9=667, 99.99=59455] 
2020-10-17 17:08:02:555 42 sec: 79798 operations; 1829 current ops/sec; est completion in 3 minutes [UPDATE: Count=1829, Max=10167, Min=478, Avg=542.07, 90=576, 99=632, 99.9=680, 99.99=10167] 
2020-10-17 17:08:03:555 43 sec: 81743 operations; 1945 current ops/sec; est completion in 3 minutes [UPDATE: Count=1945, Max=631, Min=461, Avg=510.42, 90=550, 99=592, 99.9=622, 99.99=631] 
2020-10-17 17:08:04:555 44 sec: 83690 operations; 1947 current ops/sec; est completion in 3 minutes [UPDATE: Count=1947, Max=660, Min=460, Avg=509.95, 90=552, 99=612, 99.9=634, 99.99=660] 
2020-10-17 17:08:05:555 45 sec: 85570 operations; 1880 current ops/sec; est completion in 3 minutes [UPDATE: Count=1880, Max=30671, Min=437, Avg=527.8, 90=551, 99=601, 99.9=693, 99.99=30671] 
2020-10-17 17:08:06:555 46 sec: 87595 operations; 2025 current ops/sec; est completion in 3 minutes [UPDATE: Count=2025, Max=677, Min=439, Avg=490.45, 90=537, 99=583, 99.9=628, 99.99=677] 
2020-10-17 17:08:07:555 47 sec: 89550 operations; 1955 current ops/sec; est completion in 3 minutes [UPDATE: Count=1955, Max=5387, Min=440, Avg=507.61, 90=547, 99=617, 99.9=982, 99.99=5387] 
2020-10-17 17:08:08:555 48 sec: 91505 operations; 1955 current ops/sec; est completion in 3 minutes [UPDATE: Count=1955, Max=918, Min=441, Avg=507.55, 90=546, 99=602, 99.9=705, 99.99=918] 
2020-10-17 17:08:09:555 49 sec: 93477 operations; 1972 current ops/sec; est completion in 3 minutes [UPDATE: Count=1972, Max=689, Min=444, Avg=503.4, 90=543, 99=606, 99.9=659, 99.99=689] 
2020-10-17 17:08:10:555 50 sec: 95394 operations; 1917 current ops/sec; est completion in 3 minutes [UPDATE: Count=1917, Max=849, Min=453, Avg=517.9, 90=558, 99=626, 99.9=660, 99.99=849] 
2020-10-17 17:08:11:555 51 sec: 96911 operations; 1517 current ops/sec; est completion in 3 minutes [UPDATE: Count=1517, Max=214143, Min=416, Avg=654.63, 90=560, 99=644, 99.9=4235, 99.99=214143] 
2020-10-17 17:08:12:555 52 sec: 99086 operations; 2175 current ops/sec; est completion in 3 minutes [UPDATE: Count=2175, Max=716, Min=416, Avg=457.11, 90=499, 99=547, 99.9=614, 99.99=716] 
2020-10-17 17:08:13:555 53 sec: 101160 operations; 2074 current ops/sec; est completion in 3 minutes [UPDATE: Count=2073, Max=1068, Min=418, Avg=478.89, 90=530, 99=580, 99.9=733, 99.99=1068] 
2020-10-17 17:08:14:555 54 sec: 103049 operations; 1889 current ops/sec; est completion in 3 minutes [UPDATE: Count=1890, Max=5783, Min=454, Avg=524.94, 90=578, 99=638, 99.9=705, 99.99=5783] 
2020-10-17 17:08:15:555 55 sec: 105009 operations; 1960 current ops/sec; est completion in 3 minutes [UPDATE: Count=1960, Max=650, Min=451, Avg=506.71, 90=546, 99=597, 99.9=627, 99.99=650] 
2020-10-17 17:08:16:555 56 sec: 106938 operations; 1929 current ops/sec; est completion in 3 minutes [UPDATE: Count=1929, Max=4923, Min=454, Avg=514.36, 90=552, 99=601, 99.9=626, 99.99=4923] 
2020-10-17 17:08:17:555 57 sec: 108726 operations; 1788 current ops/sec; est completion in 3 minutes [UPDATE: Count=1788, Max=1094, Min=452, Avg=555.52, 90=745, 99=891, 99.9=996, 99.99=1094] 
2020-10-17 17:08:18:555 58 sec: 110555 operations; 1829 current ops/sec; est completion in 3 minutes [UPDATE: Count=1829, Max=4675, Min=457, Avg=541.88, 90=662, 99=916, 99.9=1007, 99.99=4675] 
2020-10-17 17:08:19:555 59 sec: 111446 operations; 891 current ops/sec; est completion in 3 minutes [UPDATE: Count=890, Max=767, Min=471, Avg=509.58, 90=534, 99=688, 99.9=763, 99.99=767] 
2020-10-17 17:08:20:555 60 sec: 113124 operations; 1678 current ops/sec; est completion in 3 minutes [UPDATE: Count=1679, Max=715775, Min=451, Avg=916.13, 90=526, 99=564, 99.9=618, 99.99=715775] 
2020-10-17 17:08:21:556 61 sec: 114754 operations; 1630 current ops/sec; est completion in 3 minutes [UPDATE: Count=1630, Max=183551, Min=429, Avg=609.86, 90=538, 99=612, 99.9=775, 99.99=183551] 
2020-10-17 17:08:22:555 62 sec: 116780 operations; 2026 current ops/sec; est completion in 3 minutes [UPDATE: Count=2026, Max=906, Min=431, Avg=490.5, 90=532, 99=561, 99.9=731, 99.99=906] 
2020-10-17 17:08:23:555 63 sec: 118778 operations; 1998 current ops/sec; est completion in 3 minutes [UPDATE: Count=1998, Max=731, Min=454, Avg=497.67, 90=532, 99=583, 99.9=615, 99.99=731] 
2020-10-17 17:08:24:555 64 sec: 120723 operations; 1945 current ops/sec; est completion in 3 minutes [UPDATE: Count=1944, Max=31999, Min=444, Avg=510.97, 90=530, 99=567, 99.9=610, 99.99=31999] 
2020-10-17 17:08:25:555 65 sec: 122717 operations; 1994 current ops/sec; est completion in 3 minutes [UPDATE: Count=1994, Max=2179, Min=443, Avg=498.18, 90=538, 99=592, 99.9=706, 99.99=2179] 
2020-10-17 17:08:26:556 66 sec: 124693 operations; 1976 current ops/sec; est completion in 3 minutes [UPDATE: Count=1977, Max=13175, Min=444, Avg=502.84, 90=529, 99=579, 99.9=1083, 99.99=13175] 
2020-10-17 17:08:27:555 67 sec: 126671 operations; 1978 current ops/sec; est completion in 3 minutes [UPDATE: Count=1978, Max=748, Min=450, Avg=501.87, 90=536, 99=589, 99.9=674, 99.99=748] 
2020-10-17 17:08:28:555 68 sec: 128699 operations; 2028 current ops/sec; est completion in 3 minutes [UPDATE: Count=2028, Max=697, Min=442, Avg=489.94, 90=526, 99=567, 99.9=620, 99.99=697] 
2020-10-17 17:08:29:556 69 sec: 130737 operations; 2038 current ops/sec; est completion in 3 minutes [UPDATE: Count=2038, Max=1912, Min=443, Avg=487.77, 90=524, 99=586, 99.9=645, 99.99=1912] 
2020-10-17 17:08:30:555 70 sec: 132721 operations; 1984 current ops/sec; est completion in 3 minutes [UPDATE: Count=1984, Max=12839, Min=444, Avg=500.31, 90=532, 99=584, 99.9=660, 99.99=12839] 
2020-10-17 17:08:31:555 71 sec: 134700 operations; 1979 current ops/sec; est completion in 3 minutes [UPDATE: Count=1979, Max=675, Min=448, Avg=501.72, 90=536, 99=589, 99.9=639, 99.99=675] 
2020-10-17 17:08:32:555 72 sec: 136612 operations; 1912 current ops/sec; est completion in 3 minutes [UPDATE: Count=1912, Max=78399, Min=424, Avg=519.72, 90=524, 99=571, 99.9=733, 99.99=78399] 
2020-10-17 17:08:33:555 73 sec: 138745 operations; 2133 current ops/sec; est completion in 3 minutes [UPDATE: Count=2133, Max=638, Min=423, Avg=465.95, 90=507, 99=556, 99.9=624, 99.99=638] 
2020-10-17 17:08:34:555 74 sec: 140876 operations; 2131 current ops/sec; est completion in 3 minutes [UPDATE: Count=2131, Max=585, Min=420, Avg=466.39, 90=508, 99=546, 99.9=581, 99.99=585] 
2020-10-17 17:08:35:555 75 sec: 142994 operations; 2118 current ops/sec; est completion in 3 minutes [UPDATE: Count=2117, Max=8871, Min=421, Avg=469.21, 90=506, 99=548, 99.9=607, 99.99=8871] 
2020-10-17 17:08:36:555 76 sec: 145125 operations; 2131 current ops/sec; est completion in 3 minutes [UPDATE: Count=2132, Max=592, Min=421, Avg=466.27, 90=508, 99=548, 99.9=577, 99.99=592] 
2020-10-17 17:08:37:555 77 sec: 147261 operations; 2136 current ops/sec; est completion in 3 minutes [UPDATE: Count=2135, Max=886, Min=422, Avg=465.49, 90=509, 99=546, 99.9=572, 99.99=886] 
2020-10-17 17:08:38:555 78 sec: 149322 operations; 2061 current ops/sec; est completion in 3 minutes [UPDATE: Count=2062, Max=13911, Min=422, Avg=482.1, 90=519, 99=564, 99.9=588, 99.99=13911] 
2020-10-17 17:08:39:556 79 sec: 151421 operations; 2099 current ops/sec; est completion in 3 minutes [UPDATE: Count=2099, Max=595, Min=421, Avg=473.52, 90=514, 99=556, 99.9=589, 99.99=595] 
2020-10-17 17:08:40:555 80 sec: 153437 operations; 2016 current ops/sec; est completion in 3 minutes [UPDATE: Count=2015, Max=33471, Min=420, Avg=492.95, 90=517, 99=558, 99.9=620, 99.99=33471] 
2020-10-17 17:08:41:555 81 sec: 155501 operations; 2064 current ops/sec; est completion in 3 minutes [UPDATE: Count=2065, Max=679, Min=428, Avg=481.18, 90=519, 99=563, 99.9=613, 99.99=679] 
2020-10-17 17:08:42:555 82 sec: 157364 operations; 1863 current ops/sec; est completion in 2 minutes [UPDATE: Count=1863, Max=79359, Min=420, Avg=533.31, 90=522, 99=564, 99.9=8903, 99.99=79359] 
2020-10-17 17:08:43:555 83 sec: 159476 operations; 2112 current ops/sec; est completion in 2 minutes [UPDATE: Count=2112, Max=613, Min=422, Avg=470.47, 90=512, 99=555, 99.9=582, 99.99=613] 
2020-10-17 17:08:44:555 84 sec: 161601 operations; 2125 current ops/sec; est completion in 2 minutes [UPDATE: Count=2125, Max=846, Min=423, Avg=467.67, 90=509, 99=556, 99.9=583, 99.99=846] 
2020-10-17 17:08:45:555 85 sec: 163716 operations; 2115 current ops/sec; est completion in 2 minutes [UPDATE: Count=2114, Max=619, Min=423, Avg=470.01, 90=511, 99=553, 99.9=588, 99.99=619] 
2020-10-17 17:08:46:555 86 sec: 165764 operations; 2048 current ops/sec; est completion in 2 minutes [UPDATE: Count=2049, Max=12871, Min=425, Avg=484.78, 90=521, 99=580, 99.9=733, 99.99=12871] 
2020-10-17 17:08:47:555 87 sec: 167791 operations; 2027 current ops/sec; est completion in 2 minutes [UPDATE: Count=2026, Max=7827, Min=425, Avg=490.1, 90=526, 99=575, 99.9=785, 99.99=7827] 
2020-10-17 17:08:48:555 88 sec: 169840 operations; 2049 current ops/sec; est completion in 2 minutes [UPDATE: Count=2050, Max=644, Min=426, Avg=484.62, 90=525, 99=570, 99.9=600, 99.99=644] 
2020-10-17 17:08:49:555 89 sec: 171902 operations; 2062 current ops/sec; est completion in 2 minutes [UPDATE: Count=2062, Max=628, Min=426, Avg=481.78, 90=522, 99=563, 99.9=590, 99.99=628] 
2020-10-17 17:08:50:555 90 sec: 174019 operations; 2117 current ops/sec; est completion in 2 minutes [UPDATE: Count=2116, Max=9615, Min=422, Avg=469.5, 90=505, 99=545, 99.9=600, 99.99=9615] 
2020-10-17 17:08:51:555 91 sec: 176041 operations; 2022 current ops/sec; est completion in 2 minutes [UPDATE: Count=2023, Max=7771, Min=421, Avg=491.26, 90=537, 99=581, 99.9=638, 99.99=7771] 
2020-10-17 17:08:52:555 92 sec: 177973 operations; 1932 current ops/sec; est completion in 2 minutes [UPDATE: Count=1931, Max=658, Min=459, Avg=514.16, 90=549, 99=595, 99.9=633, 99.99=658] 
2020-10-17 17:08:53:555 93 sec: 179809 operations; 1836 current ops/sec; est completion in 2 minutes [UPDATE: Count=1836, Max=9023, Min=458, Avg=540.72, 90=619, 99=824, 99.9=892, 99.99=9023] 
2020-10-17 17:08:54:555 94 sec: 181594 operations; 1785 current ops/sec; est completion in 2 minutes [UPDATE: Count=1786, Max=40543, Min=460, Avg=555.87, 90=576, 99=686, 99.9=821, 99.99=40543] 
2020-10-17 17:08:55:555 95 sec: 183404 operations; 1810 current ops/sec; est completion in 2 minutes [UPDATE: Count=1810, Max=11311, Min=484, Avg=548.24, 90=587, 99=656, 99.9=774, 99.99=11311] 
2020-10-17 17:08:56:555 96 sec: 185234 operations; 1830 current ops/sec; est completion in 2 minutes [UPDATE: Count=1830, Max=718, Min=487, Avg=542.5, 90=588, 99=657, 99.9=709, 99.99=718] 
2020-10-17 17:08:57:555 97 sec: 187074 operations; 1840 current ops/sec; est completion in 2 minutes [UPDATE: Count=1840, Max=927, Min=482, Avg=539.54, 90=586, 99=648, 99.9=791, 99.99=927] 
2020-10-17 17:08:58:555 98 sec: 188861 operations; 1787 current ops/sec; est completion in 2 minutes [UPDATE: Count=1787, Max=23343, Min=470, Avg=555.41, 90=584, 99=651, 99.9=1089, 99.99=23343] 
2020-10-17 17:08:59:555 99 sec: 190720 operations; 1859 current ops/sec; est completion in 2 minutes [UPDATE: Count=1858, Max=1340, Min=468, Avg=534.11, 90=579, 99=633, 99.9=694, 99.99=1340] 
2020-10-17 17:09:00:555 100 sec: 192590 operations; 1870 current ops/sec; est completion in 2 minutes [UPDATE: Count=1870, Max=777, Min=464, Avg=530.93, 90=576, 99=630, 99.9=705, 99.99=777] 
2020-10-17 17:09:01:555 101 sec: 194454 operations; 1864 current ops/sec; est completion in 2 minutes [UPDATE: Count=1864, Max=7255, Min=455, Avg=532.28, 90=572, 99=641, 99.9=857, 99.99=7255] 
2020-10-17 17:09:02:555 102 sec: 196349 operations; 1895 current ops/sec; est completion in 2 minutes [UPDATE: Count=1896, Max=1021, Min=448, Avg=523.72, 90=565, 99=669, 99.9=779, 99.99=1021] 
2020-10-17 17:09:03:555 103 sec: 198170 operations; 1821 current ops/sec; est completion in 2 minutes [UPDATE: Count=1821, Max=903, Min=443, Avg=545.14, 90=589, 99=650, 99.9=775, 99.99=903] 
2020-10-17 17:09:04:555 104 sec: 199980 operations; 1810 current ops/sec; est completion in 2 minutes [UPDATE: Count=1810, Max=6171, Min=456, Avg=548.11, 90=584, 99=649, 99.9=803, 99.99=6171] 
2020-10-17 17:09:05:555 105 sec: 201503 operations; 1523 current ops/sec; est completion in 2 minutes [UPDATE: Count=1522, Max=1044, Min=503, Avg=652.67, 90=764, 99=923, 99.9=1030, 99.99=1044] 
2020-10-17 17:09:06:555 106 sec: 202849 operations; 1346 current ops/sec; est completion in 2 minutes [UPDATE: Count=1346, Max=899, Min=509, Avg=602.39, 90=661, 99=765, 99.9=850, 99.99=899] 
2020-10-17 17:09:07:555 107 sec: 204729 operations; 1880 current ops/sec; est completion in 2 minutes [UPDATE: Count=1881, Max=203263, Min=460, Avg=625.38, 90=555, 99=614, 99.9=801, 99.99=203263] 
2020-10-17 17:09:08:556 108 sec: 206670 operations; 1941 current ops/sec; est completion in 2 minutes [UPDATE: Count=1941, Max=6663, Min=461, Avg=511.5, 90=539, 99=587, 99.9=725, 99.99=6663] 
2020-10-17 17:09:09:555 109 sec: 208634 operations; 1964 current ops/sec; est completion in 2 minutes [UPDATE: Count=1964, Max=1021, Min=445, Avg=505.47, 90=542, 99=778, 99.9=888, 99.99=1021] 
2020-10-17 17:09:10:555 110 sec: 210439 operations; 1805 current ops/sec; est completion in 2 minutes [UPDATE: Count=1805, Max=1919, Min=423, Avg=550.85, 90=809, 99=918, 99.9=1003, 99.99=1919] 
2020-10-17 17:09:11:555 111 sec: 212279 operations; 1840 current ops/sec; est completion in 2 minutes [UPDATE: Count=1839, Max=943, Min=424, Avg=462.27, 90=504, 99=792, 99.9=890, 99.99=943] 
2020-10-17 17:09:12:555 112 sec: 213625 operations; 1346 current ops/sec; est completion in 2 minutes [UPDATE: Count=1346, Max=519423, Min=422, Avg=847.28, 90=503, 99=544, 99.9=731, 99.99=519423] 
2020-10-17 17:09:13:555 113 sec: 215784 operations; 2159 current ops/sec; est completion in 2 minutes [UPDATE: Count=2160, Max=580, Min=423, Avg=460.28, 90=501, 99=540, 99.9=560, 99.99=580] 
2020-10-17 17:09:14:555 114 sec: 217954 operations; 2170 current ops/sec; est completion in 2 minutes [UPDATE: Count=2169, Max=822, Min=419, Avg=458.09, 90=499, 99=544, 99.9=622, 99.99=822] 
2020-10-17 17:09:15:555 115 sec: 220197 operations; 2243 current ops/sec; est completion in 2 minutes [UPDATE: Count=2243, Max=750, Min=417, Avg=443.33, 90=477, 99=544, 99.9=621, 99.99=750] 
2020-10-17 17:09:16:556 116 sec: 222331 operations; 2134 current ops/sec; est completion in 2 minutes [UPDATE: Count=2135, Max=23263, Min=419, Avg=465.98, 90=493, 99=533, 99.9=589, 99.99=23263] 
2020-10-17 17:09:17:555 117 sec: 224392 operations; 2061 current ops/sec; est completion in 2 minutes [UPDATE: Count=2060, Max=3625, Min=443, Avg=481.85, 90=516, 99=560, 99.9=710, 99.99=3625] 
2020-10-17 17:09:18:556 118 sec: 226437 operations; 2045 current ops/sec; est completion in 2 minutes [UPDATE: Count=2046, Max=1988, Min=441, Avg=486.19, 90=524, 99=575, 99.9=657, 99.99=1988] 
2020-10-17 17:09:19:555 119 sec: 227907 operations; 1470 current ops/sec; est completion in 2 minutes [UPDATE: Count=1470, Max=211967, Min=443, Avg=676.22, 90=533, 99=584, 99.9=42463, 99.99=211967] 
2020-10-17 17:09:20:555 120 sec: 229893 operations; 1986 current ops/sec; est completion in 2 minutes [UPDATE: Count=1985, Max=757, Min=451, Avg=500.25, 90=536, 99=583, 99.9=638, 99.99=757] 
2020-10-17 17:09:21:555 121 sec: 231863 operations; 1970 current ops/sec; est completion in 2 minutes [UPDATE: Count=1970, Max=4763, Min=446, Avg=504.03, 90=535, 99=578, 99.9=625, 99.99=4763] 
2020-10-17 17:09:22:555 122 sec: 234016 operations; 2153 current ops/sec; est completion in 2 minutes [UPDATE: Count=2154, Max=692, Min=427, Avg=461.69, 90=503, 99=550, 99.9=622, 99.99=692] 
2020-10-17 17:09:23:555 123 sec: 236215 operations; 2199 current ops/sec; est completion in 2 minutes [UPDATE: Count=2199, Max=733, Min=424, Avg=452.14, 90=487, 99=535, 99.9=607, 99.99=733] 
2020-10-17 17:09:24:555 124 sec: 238401 operations; 2186 current ops/sec; est completion in 2 minutes [UPDATE: Count=2186, Max=9831, Min=423, Avg=454.89, 90=484, 99=537, 99.9=592, 99.99=9831] 
2020-10-17 17:09:25:555 125 sec: 240566 operations; 2165 current ops/sec; est completion in 2 minutes [UPDATE: Count=2164, Max=663, Min=424, Avg=459.21, 90=499, 99=544, 99.9=582, 99.99=663] 
2020-10-17 17:09:26:555 126 sec: 242661 operations; 2095 current ops/sec; est completion in 2 minutes [UPDATE: Count=2095, Max=844, Min=430, Avg=474.27, 90=512, 99=557, 99.9=592, 99.99=844] 
2020-10-17 17:09:27:555 127 sec: 244782 operations; 2121 current ops/sec; est completion in 2 minutes [UPDATE: Count=2122, Max=678, Min=422, Avg=468.52, 90=508, 99=547, 99.9=590, 99.99=678] 
2020-10-17 17:09:28:555 128 sec: 246900 operations; 2118 current ops/sec; est completion in 2 minutes [UPDATE: Count=2118, Max=1169, Min=421, Avg=469.37, 90=509, 99=557, 99.9=716, 99.99=1169] 
2020-10-17 17:09:29:555 129 sec: 249132 operations; 2232 current ops/sec; est completion in 2 minutes [UPDATE: Count=2231, Max=663, Min=421, Avg=445.62, 90=477, 99=530, 99.9=575, 99.99=663] 
2020-10-17 17:09:30:555 130 sec: 251366 operations; 2234 current ops/sec; est completion in 2 minutes [UPDATE: Count=2235, Max=880, Min=419, Avg=445.03, 90=481, 99=519, 99.9=560, 99.99=880] 
2020-10-17 17:09:31:555 131 sec: 253477 operations; 2111 current ops/sec; est completion in 2 minutes [UPDATE: Count=2111, Max=55935, Min=420, Avg=471.12, 90=482, 99=531, 99.9=604, 99.99=55935] 
2020-10-17 17:09:32:555 132 sec: 255677 operations; 2200 current ops/sec; est completion in 2 minutes [UPDATE: Count=2199, Max=24719, Min=417, Avg=452.01, 90=476, 99=518, 99.9=618, 99.99=24719] 
2020-10-17 17:09:33:555 133 sec: 257942 operations; 2265 current ops/sec; est completion in 2 minutes [UPDATE: Count=2266, Max=634, Min=416, Avg=438.94, 90=471, 99=513, 99.9=621, 99.99=634] 
2020-10-17 17:09:34:555 134 sec: 260215 operations; 2273 current ops/sec; est completion in 2 minutes [UPDATE: Count=2273, Max=675, Min=416, Avg=437.45, 90=468, 99=512, 99.9=575, 99.99=675] 
2020-10-17 17:09:35:555 135 sec: 262490 operations; 2275 current ops/sec; est completion in 2 minutes [UPDATE: Count=2274, Max=625, Min=417, Avg=437.31, 90=466, 99=519, 99.9=601, 99.99=625] 
2020-10-17 17:09:36:555 136 sec: 264760 operations; 2270 current ops/sec; est completion in 2 minutes [UPDATE: Count=2270, Max=2293, Min=415, Avg=437.9, 90=465, 99=519, 99.9=642, 99.99=2293] 
2020-10-17 17:09:37:555 137 sec: 267037 operations; 2277 current ops/sec; est completion in 2 minutes [UPDATE: Count=2278, Max=867, Min=414, Avg=436.67, 90=466, 99=527, 99.9=572, 99.99=867] 
2020-10-17 17:09:38:555 138 sec: 269328 operations; 2291 current ops/sec; est completion in 1 minute [UPDATE: Count=2291, Max=653, Min=416, Avg=434.05, 90=459, 99=514, 99.9=626, 99.99=653] 
2020-10-17 17:09:39:555 139 sec: 271588 operations; 2260 current ops/sec; est completion in 1 minute [UPDATE: Count=2259, Max=2477, Min=417, Avg=439.98, 90=472, 99=517, 99.9=640, 99.99=2477] 
2020-10-17 17:09:40:555 140 sec: 273838 operations; 2250 current ops/sec; est completion in 1 minute [UPDATE: Count=2250, Max=633, Min=419, Avg=441.97, 90=476, 99=517, 99.9=551, 99.99=633] 
2020-10-17 17:09:41:555 141 sec: 276060 operations; 2222 current ops/sec; est completion in 1 minute [UPDATE: Count=2222, Max=13255, Min=419, Avg=447.52, 90=474, 99=533, 99.9=636, 99.99=13255] 
2020-10-17 17:09:42:555 142 sec: 278324 operations; 2264 current ops/sec; est completion in 1 minute [UPDATE: Count=2265, Max=668, Min=418, Avg=439.16, 90=470, 99=518, 99.9=617, 99.99=668] 
2020-10-17 17:09:43:555 143 sec: 280132 operations; 1808 current ops/sec; est completion in 1 minute [UPDATE: Count=1807, Max=168063, Min=417, Avg=550.31, 90=498, 99=554, 99.9=696, 99.99=168063] 
2020-10-17 17:09:44:555 144 sec: 282314 operations; 2182 current ops/sec; est completion in 1 minute [UPDATE: Count=2183, Max=682, Min=418, Avg=455.53, 90=498, 99=535, 99.9=599, 99.99=682] 
2020-10-17 17:09:45:555 145 sec: 284494 operations; 2180 current ops/sec; est completion in 1 minute [UPDATE: Count=2179, Max=663, Min=419, Avg=456.1, 90=499, 99=537, 99.9=605, 99.99=663] 
2020-10-17 17:09:46:555 146 sec: 286736 operations; 2242 current ops/sec; est completion in 1 minute [UPDATE: Count=2243, Max=660, Min=418, Avg=443.41, 90=480, 99=517, 99.9=610, 99.99=660] 
2020-10-17 17:09:47:555 147 sec: 288851 operations; 2115 current ops/sec; est completion in 1 minute [UPDATE: Count=2115, Max=14031, Min=419, Avg=470.08, 90=572, 99=669, 99.9=926, 99.99=14031] 
2020-10-17 17:09:48:555 148 sec: 291056 operations; 2205 current ops/sec; est completion in 1 minute [UPDATE: Count=2205, Max=21487, Min=420, Avg=450.87, 90=474, 99=525, 99.9=626, 99.99=21487] 
2020-10-17 17:09:49:555 149 sec: 293287 operations; 2231 current ops/sec; est completion in 1 minute [UPDATE: Count=2230, Max=780, Min=420, Avg=445.83, 90=482, 99=529, 99.9=737, 99.99=780] 
2020-10-17 17:09:50:555 150 sec: 295497 operations; 2210 current ops/sec; est completion in 1 minute [UPDATE: Count=2210, Max=12671, Min=419, Avg=449.83, 90=481, 99=525, 99.9=597, 99.99=12671] 
2020-10-17 17:09:51:555 151 sec: 297722 operations; 2225 current ops/sec; est completion in 1 minute [UPDATE: Count=2226, Max=636, Min=419, Avg=446.88, 90=483, 99=528, 99.9=620, 99.99=636] 
2020-10-17 17:09:52:555 152 sec: 299941 operations; 2219 current ops/sec; est completion in 1 minute [UPDATE: Count=2219, Max=708, Min=419, Avg=448.11, 90=484, 99=528, 99.9=586, 99.99=708] 
2020-10-17 17:09:53:555 153 sec: 302073 operations; 2132 current ops/sec; est completion in 1 minute [UPDATE: Count=2132, Max=652, Min=426, Avg=466.23, 90=503, 99=550, 99.9=612, 99.99=652] 
2020-10-17 17:09:54:555 154 sec: 304218 operations; 2145 current ops/sec; est completion in 1 minute [UPDATE: Count=2144, Max=596, Min=428, Avg=463.6, 90=497, 99=542, 99.9=571, 99.99=596] 
2020-10-17 17:09:55:555 155 sec: 306043 operations; 1825 current ops/sec; est completion in 1 minute [UPDATE: Count=1826, Max=70847, Min=420, Avg=544.96, 90=498, 99=550, 99.9=40447, 99.99=70847] 
2020-10-17 17:09:56:555 156 sec: 308021 operations; 1978 current ops/sec; est completion in 1 minute [UPDATE: Count=1978, Max=1472, Min=421, Avg=502.8, 90=717, 99=819, 99.9=917, 99.99=1472] 
2020-10-17 17:09:57:555 157 sec: 310081 operations; 2060 current ops/sec; est completion in 1 minute [UPDATE: Count=2059, Max=8623, Min=423, Avg=482.62, 90=538, 99=818, 99.9=985, 99.99=8623] 
2020-10-17 17:09:58:555 158 sec: 311523 operations; 1442 current ops/sec; est completion in 1 minute [UPDATE: Count=1443, Max=332031, Min=424, Avg=690.4, 90=500, 99=667, 99.9=786, 99.99=332031] 
2020-10-17 17:09:59:555 159 sec: 313691 operations; 2168 current ops/sec; est completion in 1 minute [UPDATE: Count=2168, Max=563, Min=425, Avg=458.7, 90=495, 99=534, 99.9=558, 99.99=563] 
2020-10-17 17:10:00:555 160 sec: 315842 operations; 2151 current ops/sec; est completion in 1 minute [UPDATE: Count=2151, Max=12391, Min=425, Avg=462.08, 90=494, 99=534, 99.9=582, 99.99=12391] 
2020-10-17 17:10:01:555 161 sec: 317974 operations; 2132 current ops/sec; est completion in 1 minute [UPDATE: Count=2131, Max=625, Min=424, Avg=466.31, 90=507, 99=546, 99.9=577, 99.99=625] 
2020-10-17 17:10:02:555 162 sec: 319965 operations; 1991 current ops/sec; est completion in 1 minute [UPDATE: Count=1992, Max=633, Min=441, Avg=498.91, 90=545, 99=595, 99.9=627, 99.99=633] 
2020-10-17 17:10:03:555 163 sec: 321888 operations; 1923 current ops/sec; est completion in 1 minute [UPDATE: Count=1922, Max=12287, Min=460, Avg=516.43, 90=544, 99=589, 99.9=634, 99.99=12287] 
2020-10-17 17:10:04:555 164 sec: 323762 operations; 1874 current ops/sec; est completion in 1 minute [UPDATE: Count=1875, Max=39711, Min=446, Avg=529.65, 90=542, 99=582, 99.9=622, 99.99=39711] 
2020-10-17 17:10:05:555 165 sec: 325824 operations; 2062 current ops/sec; est completion in 1 minute [UPDATE: Count=2061, Max=977, Min=435, Avg=482.09, 90=519, 99=566, 99.9=613, 99.99=977] 
2020-10-17 17:10:06:555 166 sec: 327876 operations; 2052 current ops/sec; est completion in 1 minute [UPDATE: Count=2053, Max=1178, Min=435, Avg=483.99, 90=520, 99=558, 99.9=647, 99.99=1178] 
2020-10-17 17:10:07:555 167 sec: 329923 operations; 2047 current ops/sec; est completion in 1 minute [UPDATE: Count=2047, Max=899, Min=430, Avg=485.43, 90=521, 99=567, 99.9=696, 99.99=899] 
2020-10-17 17:10:08:555 168 sec: 331965 operations; 2042 current ops/sec; est completion in 1 minute [UPDATE: Count=2042, Max=939, Min=429, Avg=486.42, 90=523, 99=564, 99.9=768, 99.99=939] 
2020-10-17 17:10:09:555 169 sec: 334009 operations; 2044 current ops/sec; est completion in 1 minute [UPDATE: Count=2043, Max=944, Min=433, Avg=486.08, 90=521, 99=564, 99.9=626, 99.99=944] 
2020-10-17 17:10:10:555 170 sec: 335834 operations; 1825 current ops/sec; est completion in 1 minute [UPDATE: Count=1826, Max=52703, Min=425, Avg=544.61, 90=515, 99=559, 99.9=17327, 99.99=52703] 
2020-10-17 17:10:11:555 171 sec: 337945 operations; 2111 current ops/sec; est completion in 1 minute [UPDATE: Count=2110, Max=12119, Min=422, Avg=470.84, 90=503, 99=557, 99.9=840, 99.99=12119] 
2020-10-17 17:10:12:555 172 sec: 340004 operations; 2059 current ops/sec; est completion in 1 minute [UPDATE: Count=2059, Max=644, Min=433, Avg=482.62, 90=523, 99=564, 99.9=595, 99.99=644] 
2020-10-17 17:10:13:555 173 sec: 342051 operations; 2047 current ops/sec; est completion in 1 minute [UPDATE: Count=2048, Max=620, Min=436, Avg=485.25, 90=525, 99=568, 99.9=613, 99.99=620] 
2020-10-17 17:10:14:555 174 sec: 344119 operations; 2068 current ops/sec; est completion in 1 minute [UPDATE: Count=2067, Max=624, Min=434, Avg=480.69, 90=518, 99=561, 99.9=618, 99.99=624] 
2020-10-17 17:10:15:555 175 sec: 346203 operations; 2084 current ops/sec; est completion in 1 minute [UPDATE: Count=2084, Max=599, Min=434, Avg=476.85, 90=516, 99=556, 99.9=578, 99.99=599] 
2020-10-17 17:10:16:555 176 sec: 348305 operations; 2102 current ops/sec; est completion in 1 minute [UPDATE: Count=2103, Max=1443, Min=433, Avg=472.88, 90=516, 99=562, 99.9=838, 99.99=1443] 
2020-10-17 17:10:17:555 177 sec: 350404 operations; 2099 current ops/sec; est completion in 1 minute [UPDATE: Count=2099, Max=613, Min=434, Avg=473.55, 90=514, 99=557, 99.9=594, 99.99=613] 
2020-10-17 17:10:18:555 178 sec: 352516 operations; 2112 current ops/sec; est completion in 1 minute [UPDATE: Count=2111, Max=7215, Min=419, Avg=470.59, 90=511, 99=556, 99.9=599, 99.99=7215] 
2020-10-17 17:10:19:555 179 sec: 354752 operations; 2236 current ops/sec; est completion in 1 minute [UPDATE: Count=2236, Max=572, Min=418, Avg=444.79, 90=479, 99=530, 99.9=557, 99.99=572] 
2020-10-17 17:10:20:555 180 sec: 356978 operations; 2226 current ops/sec; est completion in 1 minute [UPDATE: Count=2227, Max=565, Min=420, Avg=446.7, 90=480, 99=523, 99.9=556, 99.99=565] 
2020-10-17 17:10:21:555 181 sec: 359157 operations; 2179 current ops/sec; est completion in 1 minute [UPDATE: Count=2179, Max=26927, Min=419, Avg=455.94, 90=473, 99=516, 99.9=542, 99.99=26927] 
2020-10-17 17:10:22:555 182 sec: 361327 operations; 2170 current ops/sec; est completion in 1 minute [UPDATE: Count=2170, Max=7179, Min=420, Avg=457.69, 90=486, 99=525, 99.9=554, 99.99=7179] 
2020-10-17 17:10:23:555 183 sec: 363459 operations; 2132 current ops/sec; est completion in 1 minute [UPDATE: Count=2131, Max=7203, Min=434, Avg=466.08, 90=496, 99=540, 99.9=582, 99.99=7203] 
2020-10-17 17:10:24:555 184 sec: 365336 operations; 1877 current ops/sec; est completion in 1 minute [UPDATE: Count=1877, Max=73727, Min=435, Avg=529.53, 90=523, 99=580, 99.9=6751, 99.99=73727] 
2020-10-17 17:10:25:555 185 sec: 367345 operations; 2009 current ops/sec; est completion in 1 minute [UPDATE: Count=2009, Max=767, Min=456, Avg=494.93, 90=529, 99=592, 99.9=704, 99.99=767] 
2020-10-17 17:10:26:555 186 sec: 369376 operations; 2031 current ops/sec; est completion in 1 minute [UPDATE: Count=2032, Max=725, Min=454, Avg=489.37, 90=521, 99=573, 99.9=695, 99.99=725] 
2020-10-17 17:10:27:555 187 sec: 371413 operations; 2037 current ops/sec; est completion in 1 minute [UPDATE: Count=2036, Max=694, Min=441, Avg=488.17, 90=520, 99=571, 99.9=692, 99.99=694] 
2020-10-17 17:10:28:555 188 sec: 373456 operations; 2043 current ops/sec; est completion in 1 minute [UPDATE: Count=2043, Max=693, Min=440, Avg=486.35, 90=521, 99=575, 99.9=669, 99.99=693] 
2020-10-17 17:10:29:555 189 sec: 375360 operations; 1904 current ops/sec; est completion in 1 minute [UPDATE: Count=1905, Max=1048, Min=444, Avg=521.63, 90=600, 99=808, 99.9=972, 99.99=1048] 
2020-10-17 17:10:30:555 190 sec: 377351 operations; 1991 current ops/sec; est completion in 1 minute [UPDATE: Count=1990, Max=7651, Min=444, Avg=498.76, 90=529, 99=653, 99.9=758, 99.99=7651] 
2020-10-17 17:10:31:555 191 sec: 379397 operations; 2046 current ops/sec; est completion in 1 minute [UPDATE: Count=2047, Max=747, Min=441, Avg=485.26, 90=521, 99=558, 99.9=676, 99.99=747] 
2020-10-17 17:10:32:555 192 sec: 381411 operations; 2014 current ops/sec; est completion in 1 minute [UPDATE: Count=2013, Max=1066, Min=442, Avg=493.28, 90=530, 99=589, 99.9=714, 99.99=1066] 
2020-10-17 17:10:33:555 193 sec: 383415 operations; 2004 current ops/sec; est completion in 59 seconds [UPDATE: Count=2004, Max=814, Min=443, Avg=495.45, 90=534, 99=605, 99.9=704, 99.99=814] 
2020-10-17 17:10:34:555 194 sec: 385534 operations; 2119 current ops/sec; est completion in 58 seconds [UPDATE: Count=2120, Max=747, Min=419, Avg=468.84, 90=524, 99=578, 99.9=701, 99.99=747] 
2020-10-17 17:10:35:555 195 sec: 387710 operations; 2176 current ops/sec; est completion in 57 seconds [UPDATE: Count=2175, Max=10487, Min=420, Avg=456.97, 90=497, 99=552, 99.9=721, 99.99=10487] 
2020-10-17 17:10:36:555 196 sec: 389530 operations; 1820 current ops/sec; est completion in 56 seconds [UPDATE: Count=1821, Max=11551, Min=468, Avg=545.18, 90=574, 99=626, 99.9=799, 99.99=11551] 
2020-10-17 17:10:37:555 197 sec: 391498 operations; 1968 current ops/sec; est completion in 55 seconds [UPDATE: Count=1967, Max=722, Min=448, Avg=504.47, 90=544, 99=587, 99.9=665, 99.99=722] 
2020-10-17 17:10:38:555 198 sec: 393353 operations; 1855 current ops/sec; est completion in 54 seconds [UPDATE: Count=1855, Max=10359, Min=469, Avg=534.84, 90=562, 99=603, 99.9=686, 99.99=10359] 
2020-10-17 17:10:39:555 199 sec: 395401 operations; 2048 current ops/sec; est completion in 53 seconds [UPDATE: Count=2049, Max=693, Min=423, Avg=484.87, 90=543, 99=588, 99.9=661, 99.99=693] 
2020-10-17 17:10:40:555 200 sec: 397482 operations; 2081 current ops/sec; est completion in 52 seconds [UPDATE: Count=2081, Max=48543, Min=417, Avg=477.65, 90=496, 99=539, 99.9=655, 99.99=48543] 
2020-10-17 17:10:41:555 201 sec: 399690 operations; 2208 current ops/sec; est completion in 51 seconds [UPDATE: Count=2208, Max=742, Min=418, Avg=450.22, 90=493, 99=545, 99.9=646, 99.99=742] 
2020-10-17 17:10:42:555 202 sec: 401513 operations; 1823 current ops/sec; est completion in 50 seconds [UPDATE: Count=1823, Max=13111, Min=419, Avg=544.93, 90=678, 99=915, 99.9=1027, 99.99=13111] 
2020-10-17 17:10:43:555 203 sec: 403412 operations; 1899 current ops/sec; est completion in 49 seconds [UPDATE: Count=1899, Max=903, Min=445, Avg=522.88, 90=580, 99=760, 99.9=896, 99.99=903] 
2020-10-17 17:10:44:555 204 sec: 405449 operations; 2037 current ops/sec; est completion in 48 seconds [UPDATE: Count=2036, Max=943, Min=434, Avg=487.78, 90=525, 99=621, 99.9=899, 99.99=943] 
2020-10-17 17:10:45:555 205 sec: 407453 operations; 2004 current ops/sec; est completion in 47 seconds [UPDATE: Count=2004, Max=945, Min=429, Avg=495.38, 90=532, 99=579, 99.9=706, 99.99=945] 
2020-10-17 17:10:46:555 206 sec: 409253 operations; 1800 current ops/sec; est completion in 46 seconds [UPDATE: Count=1801, Max=994, Min=422, Avg=552, 90=778, 99=884, 99.9=969, 99.99=994] 
2020-10-17 17:10:47:555 207 sec: 411316 operations; 2063 current ops/sec; est completion in 45 seconds [UPDATE: Count=2062, Max=1009, Min=419, Avg=482.02, 90=631, 99=832, 99.9=943, 99.99=1009] 
2020-10-17 17:10:48:555 208 sec: 412251 operations; 935 current ops/sec; est completion in 45 seconds [UPDATE: Count=935, Max=803, Min=421, Avg=455.76, 90=494, 99=659, 99.9=782, 99.99=803] 
2020-10-17 17:10:49:555 209 sec: 414267 operations; 2016 current ops/sec; est completion in 44 seconds [UPDATE: Count=2016, Max=613887, Min=420, Avg=776.33, 90=509, 99=552, 99.9=817, 99.99=613887] 
2020-10-17 17:10:50:555 210 sec: 416284 operations; 2017 current ops/sec; est completion in 43 seconds [UPDATE: Count=2017, Max=845, Min=423, Avg=492.46, 90=541, 99=596, 99.9=687, 99.99=845] 
2020-10-17 17:10:51:555 211 sec: 418253 operations; 1969 current ops/sec; est completion in 42 seconds [UPDATE: Count=1970, Max=704, Min=441, Avg=503.91, 90=542, 99=592, 99.9=669, 99.99=704] 
2020-10-17 17:10:52:555 212 sec: 420471 operations; 2218 current ops/sec; est completion in 41 seconds [UPDATE: Count=2217, Max=2755, Min=417, Avg=448.27, 90=490, 99=539, 99.9=657, 99.99=2755] 
2020-10-17 17:10:53:555 213 sec: 422730 operations; 2259 current ops/sec; est completion in 39 seconds [UPDATE: Count=2259, Max=572, Min=418, Avg=440.08, 90=473, 99=535, 99.9=569, 99.99=572] 
2020-10-17 17:10:54:555 214 sec: 424977 operations; 2247 current ops/sec; est completion in 38 seconds [UPDATE: Count=2247, Max=548, Min=419, Avg=442.45, 90=477, 99=519, 99.9=538, 99.99=548] 
2020-10-17 17:10:55:555 215 sec: 426919 operations; 1942 current ops/sec; est completion in 37 seconds [UPDATE: Count=1943, Max=7327, Min=437, Avg=511.06, 90=544, 99=607, 99.9=1056, 99.99=7327] 
2020-10-17 17:10:56:555 216 sec: 428209 operations; 1290 current ops/sec; est completion in 37 seconds [UPDATE: Count=1290, Max=230911, Min=425, Avg=771.65, 90=541, 99=603, 99.9=44511, 99.99=230911] 
2020-10-17 17:10:57:555 217 sec: 430362 operations; 2153 current ops/sec; est completion in 36 seconds [UPDATE: Count=2152, Max=732, Min=426, Avg=461.78, 90=502, 99=547, 99.9=665, 99.99=732] 
2020-10-17 17:10:58:555 218 sec: 432608 operations; 2246 current ops/sec; est completion in 34 seconds [UPDATE: Count=2246, Max=942, Min=418, Avg=442.71, 90=477, 99=527, 99.9=567, 99.99=942] 
2020-10-17 17:10:59:555 219 sec: 434862 operations; 2254 current ops/sec; est completion in 33 seconds [UPDATE: Count=2255, Max=564, Min=416, Avg=441.04, 90=473, 99=520, 99.9=554, 99.99=564] 
2020-10-17 17:11:00:555 220 sec: 437118 operations; 2256 current ops/sec; est completion in 32 seconds [UPDATE: Count=2255, Max=646, Min=416, Avg=440.75, 90=474, 99=518, 99.9=564, 99.99=646] 
2020-10-17 17:11:01:555 221 sec: 439365 operations; 2247 current ops/sec; est completion in 31 seconds [UPDATE: Count=2248, Max=570, Min=417, Avg=442.39, 90=480, 99=520, 99.9=549, 99.99=570] 
2020-10-17 17:11:02:555 222 sec: 441605 operations; 2240 current ops/sec; est completion in 30 seconds [UPDATE: Count=2239, Max=604, Min=417, Avg=444.03, 90=481, 99=518, 99.9=561, 99.99=604] 
2020-10-17 17:11:03:555 223 sec: 443821 operations; 2216 current ops/sec; est completion in 29 seconds [UPDATE: Count=2217, Max=3545, Min=418, Avg=447.91, 90=484, 99=525, 99.9=557, 99.99=3545] 
2020-10-17 17:11:04:555 224 sec: 445989 operations; 2168 current ops/sec; est completion in 28 seconds [UPDATE: Count=2167, Max=25423, Min=419, Avg=458.54, 90=484, 99=520, 99.9=673, 99.99=25423] 
2020-10-17 17:11:05:555 225 sec: 448220 operations; 2231 current ops/sec; est completion in 26 seconds [UPDATE: Count=2232, Max=567, Min=419, Avg=445.58, 90=480, 99=524, 99.9=547, 99.99=567] 
2020-10-17 17:11:06:555 226 sec: 450463 operations; 2243 current ops/sec; est completion in 25 seconds [UPDATE: Count=2242, Max=709, Min=420, Avg=443.46, 90=474, 99=524, 99.9=549, 99.99=709] 
2020-10-17 17:11:07:555 227 sec: 452676 operations; 2213 current ops/sec; est completion in 24 seconds [UPDATE: Count=2213, Max=881, Min=421, Avg=449.27, 90=485, 99=532, 99.9=588, 99.99=881] 
2020-10-17 17:11:08:555 228 sec: 454889 operations; 2213 current ops/sec; est completion in 23 seconds [UPDATE: Count=2213, Max=694, Min=422, Avg=449.34, 90=485, 99=524, 99.9=575, 99.99=694] 
2020-10-17 17:11:09:555 229 sec: 457093 operations; 2204 current ops/sec; est completion in 22 seconds [UPDATE: Count=2204, Max=2155, Min=422, Avg=451, 90=487, 99=526, 99.9=560, 99.99=2155] 
2020-10-17 17:11:10:555 230 sec: 459291 operations; 2198 current ops/sec; est completion in 21 seconds [UPDATE: Count=2198, Max=601, Min=422, Avg=452.25, 90=491, 99=534, 99.9=564, 99.99=601] 
2020-10-17 17:11:11:555 231 sec: 460893 operations; 1602 current ops/sec; est completion in 20 seconds [UPDATE: Count=1602, Max=13079, Min=422, Avg=467.5, 90=500, 99=542, 99.9=565, 99.99=13079] 
2020-10-17 17:11:12:555 232 sec: 462892 operations; 1999 current ops/sec; est completion in 19 seconds [UPDATE: Count=1999, Max=327679, Min=417, Avg=620.64, 90=494, 99=545, 99.9=709, 99.99=327679] 
2020-10-17 17:11:13:555 233 sec: 465065 operations; 2173 current ops/sec; est completion in 18 seconds [UPDATE: Count=2173, Max=729, Min=422, Avg=457.5, 90=496, 99=551, 99.9=710, 99.99=729] 
2020-10-17 17:11:14:555 234 sec: 467194 operations; 2129 current ops/sec; est completion in 17 seconds [UPDATE: Count=2130, Max=13999, Min=419, Avg=466.65, 90=499, 99=544, 99.9=674, 99.99=13999] 
2020-10-17 17:11:15:555 235 sec: 469409 operations; 2215 current ops/sec; est completion in 16 seconds [UPDATE: Count=2215, Max=752, Min=422, Avg=448.86, 90=483, 99=534, 99.9=688, 99.99=752] 
2020-10-17 17:11:16:555 236 sec: 471620 operations; 2211 current ops/sec; est completion in 15 seconds [UPDATE: Count=2211, Max=665, Min=421, Avg=449.65, 90=485, 99=531, 99.9=639, 99.99=665] 
2020-10-17 17:11:17:555 237 sec: 473846 operations; 2226 current ops/sec; est completion in 14 seconds [UPDATE: Count=2226, Max=684, Min=421, Avg=446.66, 90=480, 99=528, 99.9=659, 99.99=684] 
2020-10-17 17:11:18:555 238 sec: 476079 operations; 2233 current ops/sec; est completion in 12 seconds [UPDATE: Count=2233, Max=684, Min=422, Avg=445.32, 90=477, 99=520, 99.9=616, 99.99=684] 
2020-10-17 17:11:19:555 239 sec: 478295 operations; 2216 current ops/sec; est completion in 11 seconds [UPDATE: Count=2215, Max=8631, Min=420, Avg=448.79, 90=477, 99=530, 99.9=643, 99.99=8631] 
2020-10-17 17:11:20:555 240 sec: 480520 operations; 2225 current ops/sec; est completion in 10 seconds [UPDATE: Count=2226, Max=681, Min=421, Avg=446.77, 90=481, 99=527, 99.9=650, 99.99=681] 
2020-10-17 17:11:21:555 241 sec: 482733 operations; 2213 current ops/sec; est completion in 9 second [UPDATE: Count=2212, Max=746, Min=423, Avg=449.34, 90=485, 99=533, 99.9=680, 99.99=746] 
2020-10-17 17:11:22:555 242 sec: 484877 operations; 2144 current ops/sec; est completion in 8 second [UPDATE: Count=2144, Max=1077, Min=424, Avg=463.5, 90=508, 99=670, 99.9=805, 99.99=1077] 
2020-10-17 17:11:23:555 243 sec: 487065 operations; 2188 current ops/sec; est completion in 7 second [UPDATE: Count=2188, Max=8187, Min=424, Avg=454.4, 90=488, 99=608, 99.9=695, 99.99=8187] 
2020-10-17 17:11:24:555 244 sec: 489272 operations; 2207 current ops/sec; est completion in 6 second [UPDATE: Count=2207, Max=650, Min=424, Avg=450.42, 90=486, 99=533, 99.9=609, 99.99=650] 
2020-10-17 17:11:25:555 245 sec: 491477 operations; 2205 current ops/sec; est completion in 5 second [UPDATE: Count=2205, Max=679, Min=426, Avg=450.98, 90=487, 99=528, 99.9=630, 99.99=679] 
2020-10-17 17:11:26:555 246 sec: 493680 operations; 2203 current ops/sec; est completion in 4 second [UPDATE: Count=2203, Max=642, Min=424, Avg=451.16, 90=488, 99=535, 99.9=607, 99.99=642] 
2020-10-17 17:11:27:555 247 sec: 495591 operations; 1911 current ops/sec; est completion in 3 second [UPDATE: Count=1912, Max=127231, Min=416, Avg=520.42, 90=479, 99=532, 99.9=7907, 99.99=127231] 
2020-10-17 17:11:28:555 248 sec: 497833 operations; 2242 current ops/sec; est completion in 2 second [UPDATE: Count=2241, Max=562, Min=422, Avg=443.48, 90=475, 99=522, 99.9=552, 99.99=562] 
2020-10-17 17:11:29:521 248 sec: 500000 operations; 2243.27 current ops/sec; [CLEANUP: Count=1, Max=4, Min=4, Avg=4, 90=4, 99=4, 99.9=4, 99.99=4] [UPDATE: Count=2167, Max=661, Min=422, Avg=442.61, 90=472, 99=520, 99.9=559, 99.99=661] 
[OVERALL], RunTime(ms), 248966
[OVERALL], Throughput(ops/sec), 2008.30635508463
[TOTAL_GCS_G1_Young_Generation], Count, 20
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 471
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.18918245864897215
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 20
[TOTAL_GC_TIME], Time(ms), 471
[TOTAL_GC_TIME_%], Time(%), 0.18918245864897215
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4.0
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 4
[UPDATE], Operations, 500000
[UPDATE], AverageLatency(us), 494.446518
[UPDATE], MinLatency(us), 414
[UPDATE], MaxLatency(us), 1251327
[UPDATE], 95thPercentileLatency(us), 560
[UPDATE], 99thPercentileLatency(us), 686
[UPDATE], Return=OK, 500000